{
    "basic_info": {
      "description_header": "Hello I am Jeffrey Smith",
      "description": " I am a methodical, customer-oriented and highly competent Software Developer with the training and six years of experience to excel in supply chain management and IT related roles. Which include software engineering, data and configuration analysis, computer maintenance, network configuration, workstation troubleshooting as well as building a complete system architecture from the ground up to meet specific client requirements. I am a technically-proficient consultant well-versed in the latest hardware and software upgrades and committed to providing excellent support to users. Additionally, I am a skilled trouble-shooter who is continually focused on identifying, isolating and resolving technical issues. My other expertise in the physical building of computers and servers, hardware installation, network and systems administration. Throughout my career, I have demonstrated my ability to learn quickly and “think on my feet” as well as collaborate with internal/external partners, including interfacing with senior levels of management to ensure customer satisfaction.My technical Proficiencies is HTML, CSS, JavaScript, React, Git, GitHub, Bash, LINUX, Windows, SQL, MS Office Suite (Word, Excel, and PowerPoint). What excites me about technology is that it is always changing and there are always new things coming out that you can learn. If this is what your organization is looking for, we should definitely connect!",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Technical Documentation",
        "startDate": "2020",
        "description": "This is the first project I did with HTML and CSS and Javscript out side of school by myself. Can use HTML, JavaScript, and CSS to complete this project. Plain CSS is recommended use plain CSS. You can use Bootstrap or SASS if you choose. Additional technologies (just for example jQuery, React, Angular, or Vue) are not recommended for this project.",
        "images": [
          "images/portfolio/animal-shelter/Techinacal Documentation.jpg"
          
        ],
        "url": " https://jeffrey-s-smith.github.io/technical_documentation_page/technical_documentation_index.html",
        "technologies": [
          {
            "class": "devicon-html5-plain-wordmark colored",
            "name": "HTML"
          },
          {
            "class": "devicon-css3-plain-wordmark colored",
            "name": "CSS"
          },
          {
            "class": "devicon-javascript-plain colored",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Salmon Cookies",
        "startDate": "2021",
        "description": "Your friend Pat has come up with a business idea by combining two signature Seattle icons: Pat has developed a recipe for a coffee-time confection called Salmon Cookies. These cookies made into the shape of a salmon that has just a hint of fishy goodness. Pat needs some help with the branding of the business, as well as some help with internal data management for the company, and has enlisted your assistance because of your extensive and proven work in developing web applications.",
        "images": [
          "images/portfolio/photography/Project 201 Pat's Salmon Cookies.jpg"
          
        ],
        "url": "https://github.com/Jeffrey-S-Smith/cookie-stand",
        "technologies": [
          {
            "class": "devicon-html5-plain-wordmark colored",
            "name": "HTML"
          },
          {
            "class": "devicon-css3-plain-wordmark colored",
            "name": "CSS"
          },
          {
            "class": "devicon-javascript-plain colored",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Cap'n MadLib on the High Sea",
        "startDate": "2021",
        "description": "Project was to create a entertainment to take away your boredom on a rain day. So we created a game that takes MadLib's and battleship and combines them both together.",
        "images": [
          "images/portfolio/adventure/High Sea.jpg"
          
        ],
        "url": "https://green-velvet.github.io/Witty-Mad-Libs/",
        "technologies": [
          {
            "class": "devicon-html5-plain-wordmark colored",
            "name": "HTML"
          },
          {
            "class": "devicon-css3-plain-wordmark colored",
            "name": "CSS"
          },
          {
            "class": "devicon-javascript-plain colored",
            "name": "JavaScript"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
