{
    "basic_info": {
      "description_header": "Hello I am Jeffrey Smith",
      "description": " I am a methodical, customer-oriented and highly competent Software Developer with the training and six years of experience to excel in supply chain management and IT related roles. Which include software engineering, data and configuration analysis, computer maintenance, network configuration, workstation troubleshooting as well as building a complete system architecture from the ground up to meet specific client requirements. I am a technically-proficient consultant well-versed in the latest hardware and software upgrades and committed to providing excellent support to users. Additionally, I am a skilled trouble-shooter who is continually focused on identifying, isolating and resolving technical issues. My other expertise in the physical building of computers and servers, hardware installation, network and systems administration. Throughout my career, I have demonstrated my ability to learn quickly and “think on my feet” as well as collaborate with internal/external partners, including interfacing with senior levels of management to ensure customer satisfaction.My technical Proficiencies is HTML, CSS, JavaScript, React, Git, GitHub, Bash, LINUX, Windows, SQL, MS Office Suite (Word, Excel, and PowerPoint). What excites me about technology is that it is always changing and there are always new things coming out that you can learn. If this is what your organization is looking for, we should definitely connect!",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Animal Shelter",
        "startDate": "2020",
        "description": "The most expanded application I had opportunity to work with. I've learned many technologies and my code was reviewed by awesome curator. Application handles all adoption processess and allows to store all evidence on adopting animals from animal shelter.",
        "images": [
          "images/portfolio/animal-shelter/p1.jpg",
          "images/portfolio/animal-shelter/p2.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "HTML"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "CSS"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "Photography",
        "startDate": "2018",
        "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
        "images": [
          "images/portfolio/photography/p1.jpg",
          "images/portfolio/photography/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "3D Object Viewer",
        "startDate": "2015",
        "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
